In [1]:
#Functions of Panda:-
#1.read_csv() : reads data seperated by comma
#2.head() : gives dataframe of top 5 rows
#3. describe() : gives statitical analysis of data9(of int and float type data)
#4. loc[:] : Give output of groups and rows
#5. Categorical() : Gives how many categories of data in column

In [4]:
#1. read_csv()
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
#1 head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#3describe
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
#4 loc[:]
df.loc[0:2, ["PassengerId", "Survived", "Pclass"]]

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3

In [13]:
#5 Categorical
pd.Categorical(df["Survived"])

[0, 1, 1, 1, 0, ..., 0, 1, 0, 1, 0]
Length: 891
Categories (2, int64): [0, 1]

In [14]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [17]:
a = pd.Series(["Data Science Master 2.0", "Decode with C ++", "Decode with Java"], name = "Courses")
b = pd.Series([3500, 5999, 5999], name = "Fees")
c = pd.Series(["20 Feb 2023", "10 Dec 2023", "7 Feb 2024"], name = "Launch Date")
df2 = pd.concat([a,b,c], axis = 1)

In [18]:
df2.index+= 1
df2

                   Courses  Fees  Launch Date
1  Data Science Master 2.0  3500  20 Feb 2023
2         Decode with C ++  5999  10 Dec 2023
3         Decode with Java  5999   7 Feb 2024

In [41]:
Var = pd.Series(["A", "B", "C", "D", "E", "F"], name = "variables")
Val = pd.Series([10, 20, 30, 40, 50, 60], name = "values")
df = pd.concat([Var, Val], axis = 1)

In [42]:
def row_sum(df):
    c=0
    sum = 0
    for index in range(len(df)):
        if c == 3:
            break
        c = c + 1
        sum = sum + df.loc[index, "values"]
    return (sum)

In [43]:
print(row_sum(df))

60

In [98]:
text = pd.Series(["aljfklajaljalkdaa", "akjsfkjfndsjfnkjfn", "klfjsklfnjfnjfkjfh", "wklfjklfjlkjfjflkjfj"], name = "Text")
df = pd.concat([text], axis = 1)

In [89]:
def count_word(df):
    l = []
    for index in range(len(df)):
        a = df.loc[index, "Text"]
        c = 0
        for i in range(len(a)):
            c = c + 1
        l.append(c)
    df3 = df.assign(Word_Count = l)
    return df3

In [99]:
df

                   Text
0     aljfklajaljalkdaa
1    akjsfkjfndsjfnkjfn
2    klfjsklfnjfnjfkjfh
3  wklfjklfjlkjfjflkjfj

In [101]:
df.size # Gives Total number of rows in dataframe

4

In [103]:
df.shape # Gives total number of rows as well as column

(4, 1)

In [104]:
# pandas.read_excel is used to read excel file in python

In [109]:
Email = pd.Series(["abc@gmail.com", "john.doe@example.com", "ravi@outlook.com"], name = "Email")
df3 = pd.concat([Email], axis = 1)

In [119]:
df3

                  Email
0         abc@gmail.com
1  john.doe@example.com
2      ravi@outlook.com

In [113]:
b = "a"

In [114]:
b = b + "b"

In [140]:
def get_user(df):
    l = []
    for index in range(len(df)):
        a = df.loc[index, "Email"]
        user = ' '
        for i in a:
            if i == '@':
                break
            user = user + i
        l.append(user)
    df = df.assign(Username = l)
    return df

In [143]:
df3 = get_user(df3)

In [144]:
df3

                  Email   Username
0         abc@gmail.com        abc
1  john.doe@example.com   john.doe
2      ravi@outlook.com       ravi

In [153]:
A = pd.Series([3,8,6,2,9], name = "A")
B = pd.Series([5,2,9,3,1], name = "B")
C = pd.Series([1,7,4,5,2], name = "C")
df4 = pd.concat([A, B, C], axis = 1)

In [161]:
def fun(df):
    return df.loc[(df["A"] > 5) & (df["B"] < 10)]

In [162]:
df4 = fun(df4)

In [163]:
df4

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [4]:
Values = pd.Series([100,200,300,400,500], name = "Values")

In [5]:
df5 = pd.concat([Values], axis = 1)

In [6]:
df5

   Values
0     100
1     200
2     300
3     400
4     500

In [15]:
def mean_median_mode(df, type):
    import statistics
    if type == "mean":
        num = 0
        c = 0
        for index in range(len(df)):
            num = num + df.loc[index, "Values"]
            c = c+1
        mean = num/c
        return mean
    elif type == "median":
        l = []
        for index in range(len(df)):
            l.append(df.loc[index, "Values"])
        med = statistics.median(l)
        return med
    elif type == "mode":
        l = []
        for index in range(len(df)):
            l.append(df.loc[index, "Values"])
        mod = statistics.mode(l)
        return mod

In [8]:
mean = mean_median_mode(df5, "mean")

In [9]:
print(mean)

300.0

In [16]:
mode = mean_median_mode(df5, "mode")

In [17]:
print(mode)

100

In [18]:
median = mean_median_mode(df5, "median")

In [19]:
print(median)

300

In [33]:
def moving_average(df):
    c = 1
    l = []
    num = 0
    for index in range(len(df)):
        if c < 7 :
            l.append("NA")
            num = num + df.loc[index, "Sales"]
            c = c+1
        else:
            num = num + df.loc[index, "Sales"]
            l.append(num)
            a = df.loc[index, "Sales"]
    df = df.assign(Moving_average = l)
    return df

In [21]:
Sales = pd.Series([100,200,300,400,500,600,700,800,900,1000], name = "Sales")
Date = pd.Series(["2.01.24", "3.01.24", "4.01.24", "5.01.24", "6.01.24", "7.01.24", "8.01.24", "9.01.24", "10.01.24", "11.01.24"], name = "Date")
df5 = pd.concat([Date, Sales], axis = 1)

In [22]:
df5

       Date  Sales
0   2.01.24    100
1   3.01.24    200
2   4.01.24    300
3   5.01.24    400
4   6.01.24    500
5   7.01.24    600
6   8.01.24    700
7   9.01.24    800
8  10.01.24    900
9  11.01.24   1000

In [34]:
df5 = moving_average(df5)

In [1]:
df5

NameError: name 'df5' is not defined

In [2]:
def weekday(df):
    weekday = ["Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"]
    l = []
    c = 0
    for index in range(len(df)):
        l.append(weekday[c])
        c = c+1
        if c==7:
            c = 0
    df = df.assign(weekdays = l)
    return df

In [5]:
date = pd.Series(["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04", "2023-01-05"], name = "Date")
df6 = pd.concat([date], axis = 1)

In [6]:
df6

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [7]:
df6 = weekday(df6)
print(df6)

         Date   weekdays
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [51]:
def timestamp(df, start, end):
    l = []
    df2 = pd.DataFrame()
    for index in range(len(df)):
        d = df.loc[index, "Date"]
        if d == start:
            l.append(d)
            for i in range(index, len(df)):
                d = df.loc[i, "Date"]
                if d == end:
                    l.append(d)
                    break
                else:
                    l.append(d)
    for i in range(len(l)):
        df2 = df2.append(df.loc[df["Date"] == l[i]])
    print(df2)

In [47]:
date = pd.Series(['2023-01-01', '2023-01-02', '2023-01-05', '2023-01-07', '2023-01-09', '2023-01-10', '2023-01-19', '2023-01-21', '2023-01-25', '2023-01-31'], name = "Date")
data = pd.Series([23,34,45,65,67,76,78,87,89,90], name = "Data")
df7 = pd.concat([date, data], axis = 1)

In [48]:
df7

         Date  Data
0  2023-01-01    23
1  2023-01-02    34
2  2023-01-05    45
3  2023-01-07    65
4  2023-01-09    67
5  2023-01-10    76
6  2023-01-19    78
7  2023-01-21    87
8  2023-01-25    89
9  2023-01-31    90

In [52]:
timestamp(df7, "2023-01-02", "2023-01-25")

         Date  Data
1  2023-01-02    34
1  2023-01-02    34
2  2023-01-05    45
3  2023-01-07    65
4  2023-01-09    67
5  2023-01-10    76
6  2023-01-19    78
7  2023-01-21    87
8  2023-01-25    89

/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])
/tmp/ipykernel_77/2474138473.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df2.append(df.loc[df["Date"] == l[i]])

In [53]:
# To use basic functions of pandas we need to import pandas library